import AuthorDetails from '@/components/shared/cards/author-details'
import SidebarNewsCard from '@/components/shared/cards/sidebar-news-card'
import SectionTitle from '@/components/shared/section-title'
import React from 'react'

const ArticleBody = () => {
  return (
    <main className='flex gap-10'>
      <section className='text-slate-700 tracking-wide leading-8 font-IranSans-Light text-lg'>
        <section>
          <div className='mb-20'>
            طی روزهای اخیر ابهام‌های بزرگی در مورد فعالیت پلتفرم‌های خرید و فروش آنلاین طلا مطرح شده است که بخش زیادی از آنها به شائبه خالی‌فروشی برمی‌گردد. طبق آخرین آمار، تاکنون ۲۶۱ مجوز برای پلتفرم‌های فروش آنلاین طلا صادر شده که ۱۹۰ مورد آن مربوط به سال ۱۴۰۳ است. این حجم از علاقه شرکت‌های جدید و قدیمی به فروش طلا، باعث شده تا این سوال مهم مطرح شود که آیا واقعا طلایی که فروخته می‌شود وجود فیزیکی دارد؟
            <br /><br />
            مسئله زمانی پیچیده‌تر می‌شود که «مصطفی اکرمی»، مدیرعامل میلی در آذر ماه و همزمان با نشست خبری این شرکت، در پاسخ به سوال دیجیاتو در رابطه با این نگرانی، اعلام کرده بود که «برخی سامانه‌ها بخشی از فروش خود را به خالی‌فروشی اختصاص می‌دهند تا سود کسب کنند.»
            <br /><br />
            در نتیجه این یک دغدغه واقعی است. اما اکنون میلی بیانیه‌ای را در پاسخ به این دغدغه‌ها منتشر کرده و در مورد عملکرد خودش توضیح داده است. میلی می‌گوید در حال حاضر، ۵۴۵ کیلوگرم طلای ۱۸ عیار به کاربرانش تعهد دارد که ۴۷۸ کیلوگرم طلای ۱۸ عیار در بانک کارگشایی سپرده شده و مابقی در شعب و نمایندگی‌های این مجموعه آمادهٔ تحویل به کاربران است. در ادامه متن کامل این بیانیه را می‌خوانید.
          </div>
        </section>
      </section>
    
    </main>
  )
}

export default ArticleBody