"use client"
import React from 'react';
import withMemorize from '@/utils/wrappers/withMemorize';
import SectionTitle from '@/components/shared/section-title';
import FlexCarousel from '@/components/shared/flex-carousel';
import withMap from '@/utils/wrappers/withMap';
import MostViewedCard from '@/components/elements/cards/most-viewed';
import withAnimation from '@/utils/wrappers/withAnimation';

const MostViewed = () => {

    const mostViewed = [
        {
            id: 1,
            title: 'محصول 1',
            image: '/images/image1.jpg',
            description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 2,
            title: 'محصول 2',
            image: '/images/image2.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 3,
            title: 'محصول 3',
            image: '/images/image3.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },     {
            id: 1,
            title: 'محصول 1',
            image: '/images/image1.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 2,
            title: 'محصول 2',
            image: '/images/image2.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 3,
            title: 'محصول 3',
            image: '/images/image3.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },     {
            id: 1,
            title: 'محصول 1',
            image: '/images/image1.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 2,
            title: 'محصول 2',
            image: '/images/image2.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 3,
            title: 'محصول 3',
            image: '/images/image3.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },     {
            id: 1,
            title: 'محصول 1',
            image: '/images/image1.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 2,
            title: 'محصول 2',
            image: '/images/image2.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
        {
            id: 3,
            title: 'محصول 3',
            image: '/images/image3.jpg',
              description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنیکهای موجود در نظر گرفته شده است."
        },
    ]

    return (
        <section className='my-20'>
            <SectionTitle title="پربازدیدترین ها" />

            <FlexCarousel className="h-[350px] my-10 child:!h-full">
                {
                    withMap(mostViewed, MostViewedCard)
                }
            </FlexCarousel>
        </section>
    );
};

export default withAnimation(MostViewed);